cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'

brew 'go'
brew 'dep'
brew 'kubernetes-cli'
brew 'kops'
brew 'graphviz'
brew 'gmp'
brew 'php72'
brew 'jq'
brew 'k6'
brew 'fontconfig'
brew 'openssh'
brew 'openssl'
brew 'xz'
brew 'wrk'
brew 'libgit2'
brew 'node'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'

brew 'spaceman-diff'
brew 'spark'
brew 'wget'
brew 'httpie'

cask '1password'
cask '1password-cli'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'

cask 'font-sourcecodepro-nerd-font'
